# System Zone Element Type Air Changes Per Hour Property

Source: https://www.revitapidocs.com/2026/6c93d0e7-462a-c867-9313-2985b4bae1e6.htm

---

| System Zone Element Type Air Changes Per Hour Property |
| --- |

The air changes per hour.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double AirChangesPerHour { get; set; }
```

```
Public Property AirChangesPerHour As Double
	Get
	Set
```

```
public:
property double AirChangesPerHour {
	double get ();
	void set (double value);
}
```

```
member AirChangesPerHour : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The value should be between \[0\.0,10000]. |

See Also

#### Reference

SystemZoneElementType Class Autodesk.Revit.DB.Mechanical Namespace